app/controllers/gifs_controller.rb

  def index
    @movies = Ideas.all
---
SELECT "ideas".* FROM "ideas"

  def show
    @movie = Ideas.find_by(id: params['id'])
---
SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = 1 LIMIT 1

  def create
    @gif = Ideas.new
    @gif.name = params['name']
    @gif.explain = params['explain']
    @gif.save
---
INSERT INTO "ideas" ("created_at", "explain", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-07-30 03:07:35.386993"], ["explain", "aaaaaaaaaaaaaa"], ["name", "arda"], ["updated_at", "2014-07-30 03:07:35.386993"]]

  def edit
    @movie = Ideas.find_by(id: params['id'])
---
SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = 7 LIMIT 1

  def update
    @gif = Ideas.find_by(id: params['id'])
    @gif.name = params['name']
    @gif.explain = params['explain']
    @gif.save
---
SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = 10 LIMIT 1
UPDATE "ideas" SET "name" = ?, "updated_at" = ? WHERE "ideas"."id" = 19  [["name", "a"], ["updated_at", "2014-07-30 03:44:56.287121"]]

  def destroy
    @gif = Ideas.find_by(id: params['id'])
    @gif.destroy
---
SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = 1 LIMIT 1
DELETE FROM "ideas" WHERE "ideas"."id" = ?  [["id", 1]]